notes/7--Imperativeness-and-an-imperative-core-WHILE.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Imperativeness and an imperative core <i>WHILE</i></title>
<meta name="author" content="(Mark Armstrong)"/>
<meta name="description" content="Discussion of traits of the imperative programming paradigm
not found in pure functional languages.
a small imperative language."/>
<link rel="stylesheet" href="./reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/dist/theme/black.css" id="theme"/>

<link rel="stylesheet" href="local.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2 class="title">Imperativeness and an imperative core <i>WHILE</i></h2>
   <h3>Principles of Programming Languages</h3>
   <h4>Mark Armstrong</h4>
   <h5>Fall 2020</h5>
</section>

<section>
<section id="slide-Preamble">
<h2 id="Preamble"><span class="section-number-2">1</span> Preamble</h2>
</section>
<section id="slide-Notable-references">
<h3 id="Notable-references"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Notable references</h3>
<p>
:TODO:
</p>

</section>
<section id="slide-Table-of-contents">
<h3 id="Table-of-contents"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Table of contents</h3>
<font size="-1">
<div class="scriptsize" id="org7b28f82">
<ul>
<li><a href="#/slide-Preamble">Preamble</a></li>

</ul>

</div>
</font>

</section>
</section>
<section>
<section id="slide-Introduction">
<h2 id="Introduction"><span class="section-number-2">2</span> Introduction</h2>
<p>
In this section we leave behind the “pure” languages
which we have considered so far, and discuss the central features
of imperative languages.
</p>

<p>
We then construct a simple imperative language,
based on the <code>while</code> loop,
giving several approaches to defining its semantics
(and extend the language slightly.)
</p>

</section>
</section>
<section>
<section id="slide-The-“Von-Neumann-Architecture”">
<h2 id="The-“Von-Neumann-Architecture”"><span class="section-number-2">3</span> The “Von Neumann Architecture”</h2>
<p>
:TODO:
</p>

</section>
</section>
<section>
<section id="slide-Imperative-traits">
<h2 id="Imperative-traits"><span class="section-number-2">4</span> Imperative traits</h2>
<p>
:TODO:
</p>

</section>
</section>
<section>
<section id="slide-The-/WHILE/-language">
<h2 id="The-/WHILE/-language"><span class="section-number-2">5</span> The <i>WHILE</i> language</h2>
<p>
We now construct a simple imperative language,
and give a stack-machine based semantics for it
followed by a “small-step”, reduction based semantics for it.
</p>

<p>
After this, we will extend the language slightly
and provide other approaches to its semantics.
</p>

<p>
To begin, the language consists of
</p>
<ul>
<li>integer expressions, which may involve (integer-valued) variables,</li>
<li>boolean tests, which can only appear in conditional/iteration constructs, and</li>
<li>statements, which include assignment, composition, a conditional <code>if</code>,
and the iterating <code>while</code> statement.</li>

</ul>

</section>
<section id="slide-Syntax">
<h3 id="Syntax"><span class="section-number-3">5.1</span> Syntax</h3>
<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> &#8759;= constant_integer | variable
        | <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">(</span>'+' | '*' | '-' | '&#247;'<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> &#8759;= <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">(</span>'=' | '&lt;' | '&gt;'<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span>
        | <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">(</span>'and' | 'or'<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span> &#8759;= 'skip'
        | variable '&#8788;' <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span>
        | <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span> ';' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>
        | 'if' <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> 'then' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span> 'else' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>
        | 'while' <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> 'do' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>
</code></pre>
</div>

</section>
<section id="slide-A-stack-machine">
<h3 id="A-stack-machine"><span class="section-number-3">5.2</span> A stack-machine semantics for <i>WHILE</i></h3>
<p>
Constants are simply moved from the control stack to the results stack.
</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">&#10216;</span>n &#8729; c, r, &#963;<span style="color: #00cd68;">&#10217;</span> &#8605; <span style="color: #00cd68;">&#10216;</span>c, n &#8729; r, &#963;<span style="color: #00cd68;">&#10217;</span>
</code></pre>
</div>

<p>
For variables, we instead place the value of the variable
at the current state onto the results stack.
</p>
<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">&#10216;</span>v &#8729; c, r, &#963;<span style="color: #00cd68;">&#10217;</span> &#8605; <span style="color: #00cd68;">&#10216;</span>c, &#963;<span style="color: #b6a0ff;">(</span>v<span style="color: #b6a0ff;">)</span> &#8729; r, &#963;<span style="color: #00cd68;">&#10217;</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">&#10216;</span>'E&#8321; op E&#8322;' &#8729; c, r, &#963;<span style="color: #00cd68;">&#10217;</span> &#8605; <span style="color: #00cd68;">&#10216;</span>E&#8322; &#8729; E&#8321; &#8729; op &#8729; c, &#963;<span style="color: #b6a0ff;">(</span>v<span style="color: #b6a0ff;">)</span> &#8729; r, &#963;<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>op &#8729; c, n&#8321; &#8729; n&#8322; &#8729; r, &#963;<span style="color: #00cd68;">&#10217;</span> &#8605; <span style="color: #00cd68;">&#10216;</span>c, n &#8729; r, &#963;<span style="color: #00cd68;">&#10217;</span>   where n = n&#8321; op n&#8322;
</code></pre>
</div>

</section>
<section id="slide-org5c91b9f">
<h3 id="org5c91b9f"><span class="section-number-3">5.3</span> A small-step semantics for <i>WHILE</i></h3>

</section>
</section>
<section>
<section id="slide-The-/WHILE/-language-with-scoping">
<h2 id="The-/WHILE/-language-with-scoping"><span class="section-number-2">6</span> The <i>WHILE</i> language with scoping</h2>
<p>
We now extend our <i>WHILE</i> language with the necessary syntax
to express <i>variable scopes</i>, and then give
scoping rules for programs.
</p>

<p>
Our approach introduces both <i>global</i> and <i>local</i> variables.
</p>
<ul>
<li>Global variables may be considered to be the input/output to the program
in this model.</li>

</ul>

</section>
<section id="slide-orgb7b32ce">
<h3 id="orgb7b32ce"><span class="section-number-3">6.1</span> Syntax</h3>
<div class="org-src-container">

<pre  class="src src-text"><code trim><span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> &#8759;= constant_integer | variable
        | <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">(</span>'+' | '*' | '-' | '&#247;'<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> &#8759;= <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">(</span>'=' | '&lt;' | '&gt;'<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span>
        | <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">(</span>'and' | 'or'<span style="color: #00cd68;">)</span> <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span> &#8759;= 'skip'
        | 'local' variable 'in' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>
        | variable '&#8788;' <span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span>
        | <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span> ';' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>
        | 'if' <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> 'then' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span> 'else' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>
        | 'while' <span style="color: #00cd68;">&#10216;</span>test<span style="color: #00cd68;">&#10217;</span> 'do' <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>prog<span style="color: #00cd68;">&#10217;</span> &#8759;= <span style="color: #00cd68;">&#10216;</span>globals<span style="color: #00cd68;">&#10217;</span> <span style="color: #00cd68;">&#10216;</span>stmt<span style="color: #00cd68;">&#10217;</span>

<span style="color: #00cd68;">&#10216;</span>globals<span style="color: #00cd68;">&#10217;</span> &#8759;= 'global' <span style="color: #00cd68;">{</span> variable <span style="color: #00cd68;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org729a3ed">
<h3 id="org729a3ed"><span class="section-number-3">6.2</span> The scoping rules</h3>
<p>
:TODO:
</p>

</section>
<section id="slide-orgd7e8fc5">
<h3 id="orgd7e8fc5"><span class="section-number-3">6.3</span> A small-step semantics for <i>WHILE</i> with scoping</h3>
<p>
:TODO:
</p>

</section>
<section id="slide-org9432f1d">
<h3 id="org9432f1d"><span class="section-number-3">6.4</span> A <i>big-step</i> semantics for <i>WHILE</i> with scoping</h3>
<p>
:TODO:
</p>
</section>
</section>
</div>
</div>
<script src="./reveal.js/dist/reveal.js"></script>
<script src="./reveal.js/plugin/markdown/markdown.js"></script>
<script src="./reveal.js/plugin/zoom/zoom.js"></script>
<script src="./reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealMarkdown,RevealZoom,RevealNotes],
width:1600, height:900, controlsLayout:'edges',
margin: 0.1, minScale:0.125, maxScale:5,
mouseWheel: true,
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
]
});
</script>
</body>
</html>
